[
  {
    "id": "about",
    "name": "about",
    "description": "itsgalo is the screen-name for Galo Canizares (b. 1989, Madrid), a designer, writer, and educator working across various creative fields from architecture to digital art to experimental software. He is currently an assistant professor of architecture at the University of Kentucky’s College of Design where he teaches courses on visualization and directs the Critical Software Lab.\n\nGalo’s work interrogates the emerging sociotechnical effects of code, screens, and software culture. He is fascinated by the strange behaviors and aesthetics unique to computing and digital media, an interest that emerged as a kid playing with Flash and other painting software. In 2019, Galo published a collection of essays on computation, art, and design titled Digital Fabrications: Designer Stories for a Software-Based Planet.\n\nMany of his code-based artworks try to leverage computing to produce visually compelling and layered effects. They are often animated or use some kind of real-time motion like simulated physics. Other recurring themes are limited color palettes, dithering, and low-res graphics, concepts and techniques tied to the history of computer-based art.\n\nHe was the recipient of the 2016-17 LeFevre ’29 Emerging Practitioner Fellowship, and in 2018 was awarded the Christos Yessios Visiting Professorship at The Ohio State University. His writings have been published in various journals and magazines. His artworks and design installations have been exhibited at galleries and schools in London, New York, Los Angeles, Seattle, Chicago and many other cities. He holds a Master of Architecture from the Massachusetts Institute of Technology and a Bachelor of Environmental Design from the College of Architecture and Planning at the University of Colorado, Boulder.\n\nGalo is also co-director of office ca, a research and design collaborative that investigates alternate methods for architectural practice. Some recurring themes of the practice include absurdity, genre fiction, conspiracy theories, world-making, storytelling, simulation, and most recently, the parafictional. In 2018, office ca, won the Ragdale Ring competition.\n\nabout this website:\n\nhere you will find an archive of news, artworks, writings, and teaching. as such you will find links to events and exhibitions, but also course/workshop syllabi and links to publications. all the content provided here is free to share unless otherwise noted.\n\n@itsgalo\n@galoandstuff\n\nsite built with nextjs\ntypeset in office ca mono",
    "date": "",
    "category": ""
  }
]